# ============================================================
# Brewfile — `brew bundle --file=Brewfile` で一括インストール
# ============================================================

# ---- Taps ----
tap "nikitabobko/tap"      # AeroSpace
tap "FelixKratz/formulae"  # JankyBorders (borders)

# ---- シェル / dotfiles 基盤 ----
brew "stow"                     # dotfiles の symlink 管理
brew "starship"                 # プロンプト
brew "mise"                     # ランタイムバージョン管理
brew "direnv"                   # ディレクトリ単位の環境変数
brew "zsh-autosuggestions"      # 入力補完
brew "zsh-syntax-highlighting"  # シンタックスハイライト
brew "zsh-completions"          # 追加補完定義
brew "gh"                       # GitHub CLI
brew "borders"                  # AeroSpace のウィンドウ枠

# ---- 開発言語ツール ----
brew "rust"
brew "openjdk"
brew "php"
brew "python-setuptools"
brew "pnpm"

# ---- データベース / インフラ ----
brew "mysql"
brew "mkcert"
brew "foreman"
brew "ollama"

# ---- 画像 / メディア / ドキュメント処理 ----
brew "imagemagick"
brew "imagemagick@6"
brew "vips"
brew "ffmpeg"
brew "jpeg"
brew "libraw"
brew "giflib"
brew "libpng"
brew "cairo"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "d2"

# ---- ライブラリ / その他 ----
brew "openssl@3"
brew "libffi"
brew "libyaml"
brew "pkgconf"
brew "mecab"          # 日本語形態素解析
brew "mecab-ipadic"
brew "bitwarden-cli"
brew "conda-zsh-completion"

# ---- フォント ----
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# ---- ウィンドウ / 入力 / ランチャー ----
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "google-japanese-ime"
cask "raycast"

# ---- ターミナル / エディタ ----
cask "ghostty"
cask "iterm2"
cask "visual-studio-code"
cask "coteditor"
cask "jetbrains-toolbox"
cask "claude-code"

# ---- ブラウザ ----
cask "brave-browser"
cask "chatgpt-atlas"

# ---- 開発 / コンテナ / VPN ----
cask "docker-desktop"
cask "android-platform-tools"
cask "github"
cask "aws-vpn-client"
cask "tunnelblick"

# ---- ユーティリティ ----
cask "appcleaner"
cask "balenaetcher"
cask "bitwarden"
cask "lm-studio"

# ---- VS Code 拡張 ----
vscode "anthropic.claude-code"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode.vscode-typescript-next"
vscode "shuvamraghuvanshi.run-package-scripts"
